## Plan Result (sds_ptl_ado)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 2 to add, 0 to change, 2 to destroy.</code></pre>

* Replace
  * azurerm_role_assignment.sops-kv-reader
  * azurerm_user_assigned_identity.azure-devops-mi




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_role_assignment.sops-kv-reader must be replaced
-/+ resource "azurerm_role_assignment" "sops-kv-reader" {
      ~ id                               = "/subscriptions/6c4d2513-a873-41b4-afdd-b05a33206631/resourceGroups/genesis-rg/providers/Microsoft.KeyVault/vaults/dtssdsptl/providers/Microsoft.Authorization/roleAssignments/a4f96690-9709-93e0-0a08-ca9783d78448" -> (known after apply)
      ~ name                             = "a4f96690-9709-93e0-0a08-ca9783d78448" -> (known after apply)
      ~ principal_id                     = "c9c3076a-52c2-44b5-8c3a-3f283c2d5465" -> (known after apply) # forces replacement
      ~ principal_type                   = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/6c4d2513-a873-41b4-afdd-b05a33206631/providers/Microsoft.Authorization/roleDefinitions/acdd72a7-3385-48ef-bd42-f606fba81ae7" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # azurerm_user_assigned_identity.azure-devops-mi must be replaced
-/+ resource "azurerm_user_assigned_identity" "azure-devops-mi" {
      ~ client_id           = "dd151c0c-16c4-4adb-a840-01d11149fcdb" -> (known after apply)
      ~ id                  = "/subscriptions/6c4d2513-a873-41b4-afdd-b05a33206631/resourceGroups/managed-identities-ptl-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/azure-devops-cftptl-intsvc-mi" -> (known after apply)
      ~ name                = "azure-devops-cftptl-intsvc-mi" -> "azure-devops-ptl-mi" # forces replacement
      ~ principal_id        = "c9c3076a-52c2-44b5-8c3a-3f283c2d5465" -> (known after apply)
        tags                = {
            "application"  = "core"
            "builtFrom"    = "hmcts/ado-shared-infra"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "High"
            "environment"  = "production"
            "startupMode"  = "always"
        }
      ~ tenant_id           = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":2,"Program":"tfcmt","SHA1":"","Target":"sds_ptl_ado","Vars":{}} -->